app/controllers/tasks_controller.rb

  def index
    @to_do = current_user.tasks.where(state: "to_do")
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."state" = $2  [["user_id", 1], ["state", "to_do"]]

  def create

    @task = current_user.tasks.new(task_params)
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "task 1"], ["created_at", "2018-11-08 15:08:38.891647"], ["updated_at", "2018-11-08 15:08:38.891647"], ["user_id", 1]]

  def change
    @task.update_attributes(state: params[:state])
---
UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["state", "doing"], ["updated_at", "2018-11-08 15:08:46.040718"], ["id", 1]]